// Напишіть функцію noSwitch, яка приймає об'єкт зі значеннями-функціями, ключ для об'єкта та запускає одну з функцій з об'єкта якщо ключ знайдений, інакше - запускає default:
// const noSwitch = (key, cases, defaultKey='default') => {
//     //перевірка наявності key в cases
//     //якщо є - дістати значення по ключу. це буде функція. Запустити її
//     //якщо немає - витягти з об'єкта cases значення по ключу, ім'я якого лежить у змінній defaultKey. Запустити
//     //Нехай функція noSwitch повертає те, що повертає одна з функцій з об'єкта про всяк випадок
// }

// const drink = prompt("Що ви любите пити")
// noSwitch(drink, {
//     воду: () => console.log('Найздоровіший вибір!'),
//     чай(){
//         console.log('Смачна та корисна штука. Не перестарайтеся з цукром')
//     },
//     "пиво": () => console.log('Добре влітку, та в міру'),
//     віскі: function(){
//         console.log('Та ви, батечку, естет! Не забудьте лід і сигару')
//     },
//     default(){
//         console.log('шото я не зрозумів')
//     }
// })


const noSwitch = (key, cases, defaultKey='default') => {
    if (key in cases) {
        if (drink in cases) //перевіряємо наявність введеного користувачем ключа з об'єкта
            cases[drink]() //запускаємо функцію, що знаходиться в об'єкті по ключу із змінної drink
        else //якщо ж ключа немає, то робимо default
            cases.default()
    }
}

const drink = prompt("Що ви любите пити")
noSwitch(drink, {
    воду: () => console.log('Найздоровіший вибір!'),
    чай(){
        console.log('Смачна та корисна штука. Не перестарайтеся з цукром')
    },
    "пиво": () => console.log('Добре влітку, та в міру'),
    віскі: function(){
        console.log('Та ви, батечку, естет! Не забудьте лід і сигару')
    },
    default(){
        console.log('шото я не зрозумів')
    }
})

