// Нехай користувач введе будь-який текст із посиланням на youtube. 
// Використовуючи регулярний вираз вийміть із посилання ідентифікатор видосу і 
// створіть рядок із вбудованим блоком HTML. 
// Додайте блок на сторінку. 

// оголосіть константу з регулярним виразом
// використовуйте метод match, який поверне вам масив
// вийміть із масиву елемент із ідентифікатором відео
// вивчіть HTML код вбудовування відео на сторінку на youtube.
// використовуючи інтерполяцію рядків, вклейте ідентифікатор відео в HTML код вбудовування відео
// використовуючи document.write відправте отриманий рядок на сторінку.