// Нехай користувач вводить рядок з будь-якими парними дужками в ньому, наприклад [[](){{{[]()}}}]. 
// Знайдіть місце можливої помилки (непарності) у цьому рядку. Для цього, кожну дужку, що відкриває, додавайте в стек.
//  При знаходженні дужки, що закриває, вона повинна відповідати вершині стека (останнєй доданой дужцi). 
//  Якщо вона не відповідає, виведіть повідомлення про помилку та позицію у рядку. 
//  Якщо відповідає – приберіть дужку зі стека. Якщо рядок помилок не містить, порадуйте користувача.


// Наприклад, рядки із проблемою: [(}], [(()()()], {() () [()()}]{{{}}}


const line = prompt()
const bracketsStack = []
let   i             = 0
for (const character of line){
    //не звертайте уваги на символи, крім трьох видів дужок
    if (ПРОБЛЕМА) {
         break; //оператор break перериває цикл передчасно
    }
    i++ //iндекс поточної лiтери
}
