let a = 6 //глобальна змінна
let b = 11 //глобальна змінна
let d = 21 //глобальна змінна
console.log("1й рівень", a, b, c) // c-undefined
{
    let a = 50; //локальна змінна, яка перекриває доступ до глобальної
    let c = 2   //локальна змінна
    b = b + 1   //читаємо та змінюємо глобальну змінну
    console.log("2й рівень", a, b, c)
    {
        let a = 60 //локальна змінна, яка перекриває доступ до локальної з навколишнього блоку
        b = b + 9   //читаємо та змінюємо глобальну змінну
        c = c * 100 //читаємо та міняємо вищестоящу локальну змінну з навколишнього блоку
        console.log("3й рівень", a, b, c, d)
        {
            let c = 3 //локальна змінна, яка перекриває доступ до локальної з навколишнього блоку
            let d = 1 //локальна змінна, яка перекриває доступ до глобальної
            b = d - c
            console.log("4й рівень", a, b, c, d)
        }
    }
    console.log("5й рівень", a, b, c, d)
}
console.log("6й рівень", a, b, c, d)