// Оформіть завдання Prompt: OR як функцію, яка приймає рядок для prompt та значення за замовчуванням. 
// Функція повинна повертати введений текст або значення за замовчуванням у разі відмови користувача вводити щось. 
// Використовуйте функцію без блоку коду (функція одного виразу)

// let ageInput = prompt("Введіть свій вік:");

// if (!ageInput || ageInput.trim() === "") {
//     alert("Ви не ввели вік або натиснули скасування. Будь ласка, введіть свій вік.");
// } else {
//     alert("Ваш вік: " + ageInput);
// }


const promptWithDefault = (promptText, defaultValue) => prompt(promptText) || defaultValue;



// Приклад використання:
let ageInput = promptWithDefault("Введіть свій вік:", "Невідомий вік");

alert("Ваш вік: " + ageInput);