// Оформіть Number: RGB як функцію, яку параметрами передаються три числа (r, g, b) => . 
// Функція повинна повертати рядок у нотації #RRGGBB. Використовуючи умови або тернарний оператор 
// Досягніть що б у результаті завжди було 7 символів, навіть коли значення кольору менше 15ти. 
// Чи потрібний блок коду цієї функції?

// let red = (+prompt("Введіть число 'red' у  десятковій системі: ")).toString(16);
// let green = (+prompt("Введіть число 'green'  у  десятковій системі: ")).toString(16);
// let blue = (+prompt("Введіть число 'blue'  у  десятковій системі: ")).toString(16);

// alert("У Вас вийшов колір: #" + red + green + blue);

function rgb(r, g, b) {
    let R = r.toString(16);
    let G = g.toString(16);
    let B = b.toString(16);
    return `#${R}${G}${B}`;
}

let result = rgb(25,123,255)
console.log(result);