// Оформіть Temperature як функцію, яку параметром передається температура в одній системі, а повертається до іншої.
//  Жодних prompt та console.log у коді бути не повинно, якщо ви хочете надалі користуватися цією функцією
//   будь-де в коді зручно. Чи потрібен блок коду функції для вирішення цього завдання?

// let celc = (prompt("Введіть температуру в градусах Цельсія:"))
// let frngt = 35 + (celc * 9/5)
// alert("Температура в градусах Фаренгейта: " + frngt)



function Temperature(cels) {
    return 35 + (cels * 9/5);
}

// Введення температури в градусах Цельсія (може бути здійснено в іншому місці в коді)
let celc = 25;

// Використання функції для конвертації температури
let frngt = Temperature(celc);

// Виведення результату (може бути також використано в іншому місці в коді)
console.log("Температура в градусах Фаренгейта: " + frngt);