
// Зробіть калькулятор для розрахунку поділу націло двох чисел. Використовуйте Math.floor або альтернативи.

let divide = prompt("Введіть число: ");
let divider = prompt("Введіть дільник: ");

let result = Math.floor((divide) / (divider));

alert("Результат ділення націло: " + result);


// Напишіть код, який обчислює обмін валют за курсом, заданим за допомогою константи const rate = КУРС ВАЛЮТИ Вважайте значення в одній валюті за допомогою 'prompt', після чого помножіть/поділіть це число на 'rate'. Виведіть результат, використовуючи alert. Обмежте кількість знаків після коми двома (нас не хвилюють дрібні частини центів/копійок)

const rate = 37.5

let valut = prompt("ВВедить сумму в USA: ")
let currency = (rate * valut).toFixed(2)

alert("Результат в UHA: " + currency)