// // Зробіть калькулятор, який дозволить вам виходячи з інформації про кількість поверхів у будинку та 
// кількість квартир на поверсі знаходити під'їзд та поверх певної квартири за її номером. 
// Наприклад для 9поверхового будинку по 4 квартири на поверх 81 квартира знаходиться на 3-му поверсі 
// третього під'їзду. 
// Користувач повинен вводити за допомогою prompt кiлькiсть поверхiв, кiлькiсть квартир на поверсi та
// номер квартири. Код повинен видавати пiд'їзд та поверх по номеру квартири.


let floors = prompt("Введіть кількість поверхів у будинку:", "");
let apartmentsFloor = prompt("Введіть кількість квартир на поверсі:", "");
let flats = prompt("Введіть номер квартири:", "");


let entrance = Math.ceil(flats / (floors * apartmentsFloor));
let floor = Math.ceil((flats % (floors * apartmentsFloor)) / apartmentsFloor);

alert("Під'їзд: " + entrance + "\nПоверх: " + floor);