// Зробіть попереднє завдання, не використовуючи push, а звертаючись до елементів індексу.

// let arr = []
// while (true) {
//     let userInput = prompt("Введіть новий елемент для масиву:");
//     // Перевіряємо, чи користувач натиснув "Скасувати"
//     if (userInput === null) {
//         break; 
//     }
//     // Додаємо елемент у масив
//     arr.push(userInput);
// }
// // Виводимо отриманий масив
// console.log("Ваш масив:", arr);

let arr = []

while (true) {
    
    let userInput = prompt("Введіть новий елемент для масиву:");

    // Перевіряємо, чи користувач натиснув "Скасувати"
    if (userInput === null) {
        break; 
    }

    // Отримуємо поточну довжину масиву
    var currentLength = arr.length;

    // Додаємо новий елемент, використовуючи індексацію
    arr[currentLength] = userInput;
}

// Виводимо отриманий масив
console.log("Ваш масив:", arr);