// Створіть порожній масив і додавайте в нього елементи, введені користувачем, поки користувач не натисне Скасувати в черговому prompt. 
// Використовуйте push для зручності: push У масиві не повинно бути null після роботи циклу;


let arr = []

while (true) {
    
    let userInput = prompt("Введіть новий елемент для масиву:");

    // Перевіряємо, чи користувач натиснув "Скасувати"
    if (userInput === null) {
        break; 
    }

    // Додаємо елемент у масив
    arr.push(userInput);
}

// Виводимо отриманий масив
console.log("Ваш масив:", arr);