// Попросіть користувача ввести валюту (наприклад, usd, eur, інші валюти додати до смаку) за допомогою prompt.
// Також поцікавтеся купити чи продати він бажає (використовуйте confirm).
// За допомогою декількох if та тернарного оператора всередині кожного з if задайте змінну rate, 
// визначальну курс конкретної валюти на купівлю чи продаж. 
// Зверніть увагу на місце оголошення змінної rate - вона має бути доступна в коді після всіх цих if.
// Попросіть користувача ввести суму на обмін
// Порахуйте та виведіть результат шляхом множення або поділу на rate
// Дайте можливість користувачеві вводити назви валют у будь-якому регістрі (UsD, eUR). 
// Для цього в if використовуйте toUpperCase (або toLowerCase)



let currensy = prompt("Введіть валюту: (usd, eur)").toLowerCase()
// currensy = currensy.toLowerCase()

let Buying = confirm("Бажаєте купити: натисніть - 'Ок'\nБажаєте продати - натисніть 'cancel'")

let rate

if (currensy === "usd") {
    rate = Buying ? 38 : 36
} else if (currensy === "eur") {
    rate = Buying ? 40 : 38
} else (
    alert("Вибачте, дану валюту не приймаємо!")
)


let summ = prompt("Ведіть сумму коштів: ")

if (!summ || summ === "") {
    alert("Будь ласка, введіть числову суму.");
} else {
    let result = Buying ? summ / rate : summ * rate
    alert("Тримайте Вашу суму: " + result.toFixed(2) + " " + currensy)
}




