// Напишіть код, який запитує логін, перевіряє його на вірність, якщо логін вірний, просить ввести пароль 
// і перевіряє його. В разі розбіжності логіну чи пароля виводити alert з текстом помилки.
//  У разі успішного логіну – alert з привітанням. Правильні логін: admin та пароль: qwerty. 
//  Використовуйте вкладені if та else.



let login = prompt("Введіть Ваш логін: ")

if (login === "admin") {
    let parol = prompt("Введіть Ваш пароль: ")
    if (parol === "qwerty") {
        alert("Вітаю Вас!")
    } else {
        alert ("Введені не вірні дані")
    }
} else {
    alert ("Введені не вірні дані")
}

