// За допомогою prompt дізнайтесь число, введене користувачем. 
// За допомогою if перевірте, чи число коректно перетворено з рядка. 
// У разі помилки виведіть повідомлення Виведіть парне число чи ні, використовуючи if.



let numb = prompt('Введіть число: ')

if (+numb === +(numb)) {
    alert('Дякую Вам!')
    if (numb % 2 === 0) {
        alert("Ваше Введене число є парним.");
    } else {
        alert("Ваше Введене число є непарним.");
    }
} else {
    alert('Некоректне введення. Будь ласка, введіть число.')
}

// Але є загвоздка - якщо натискаю КЕНСЛ, то воно мені дякує і каже, що в мене парне чило - тобто 0!))))
// треба норм пограться з першим ифом

